public_html/static-web-app-picolisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>How to write a static Web-App in PicoLisp</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-01-21 Fr"/>
<meta name="author" content="Thorsten"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">How to write a static Web-App in PicoLisp</h1>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Why would anybody do that? </a></li>
<li><a href="#sec-2">2 Assumptions </a></li>
<li><a href="#sec-3">3 The <code>html</code>-Function </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Why would anybody do that? </h2>
<div class="outline-text-2" id="text-1">

<blockquote>

<p>"You can use PicoLisp to generate static HTML pages. This does not make much
sense in itself, because you could directly write HTML code as well, but it
forms the base for interactive applications, and allows us to introduce the
application server and other fundamental concepts."
(from <a href="http://software-lab.de/doc/app.html">PicoLisp Application Development</a>)
</p>
</blockquote>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Assumptions </h2>
<div class="outline-text-2" id="text-2">

<p>You have a running PicoLisp on your machine and know how to start a
PicoLisp application server that loads your PicoLisp source file
(again, see <a href="http://software-lab.de/doc/app.html">PicoLisp Application Development</a>).
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The <code>html</code>-Function </h2>
<div class="outline-text-2" id="text-3">

<p>The <code>html</code>-function is a convenient printing function. It takes four
arguments, that can be followed by an arbritary number of normal Lisp
expressions:
</p>
<ol>
<li>max-age value for cache-control (zero means "no cache")
</li>
<li>page-title
</li>
<li>a CSS-file name (NIL if using no file, a list if using more than
   one)
</li>
<li>CSS style attribute specification, passed to the <code>body</code>-tag (NIL if
   none)
</li>
</ol>

<p>
Example:
</p>


<pre class="src src-emacs-lisp">(html 0 <span style="color: #ffa07a;">"Hello"</span> <span style="color: #ffa07a;">"lib.css"</span> NIL
   <span style="color: #ffa07a;">"Hello Tech-Translation"</span>)
</pre>


</div>
</div>
<div id="postamble">
<p class="author">Author: Thorsten</p>
<p class="creator">Org version 7.5 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
